       identification division.
       program-id. simple-test.
       
       procedure division.
           display "First statement".
           perform main-001.
           stop run.
       main-001.