       identification division.
       program-id. test-paragraphs.
       procedure division.
       perform para-001.
       perform para-002.
       stop run.
       para-001.
       para-002.