       IDENTIFICATION DIVISION.
       PROGRAM-ID. TEST-SIMPLE-SQL.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 EMPLOYEE-ID PIC 9(5).

       PROCEDURE DIVISION.
       MAIN-PARA.
           EXEC SQL
               SELECT EMPLOYEE_ID FROM EMPLOYEE
           END-EXEC.
           STOP RUN. 