       identification division.
       program-id. test-area-a.
       procedure division.
       para-001.
           display "First paragraph".
       para-002.
           move 1 to ws-counter.
       para-003.
           add 1 to ws-counter.
       para-004.
           stop run.