       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROC-DIV-TEST.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TEST-VAR PIC 9.

       PROCEDURE DIVISION.
       MAIN-SECTION SECTION.
       MAIN-PARA.
           PERFORM HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
           GO TO MAIN-EXIT.

       HEAD-ROUTINE.
           MOVE 1 TO TEST-VAR.
           PERFORM WRITE-LINE 2 TIMES.

       COLUMN-NAMES-ROUTINE.
           MOVE 2 TO TEST-VAR.

       MAIN-EXIT.
           EXIT.

       CCVS-EXIT SECTION.
       CCVS-999999.
           STOP RUN. 